Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 江逸越想越心动，实在不行也是被人揍一顿而已，沉吟了一阵，他咬牙朝武殿侧门走去，对着两名黑甲护卫拱手道：“我报名陪练！”
en_us: The more Jiang Yi thought about it, the more tempted he felt. Even if he could not make it, he was only going there to receive a beating from others. Sighing deeply, he gritted his teeth and walked in the direction of the side door of the Martial Arts Hall. Cupping his hands in greeting to the two guards clad in black armor, he said, "I am here to register as a sparring partner!"

source: 江逸跟着这管事进了旁边的一个雅阁内，那管事请江逸坐下，这才抬手道：“请出示一下丹药，如果是好丹，我们会给出合理的价格。”
en_us: Jiang Yi followed the housekeeper into an elegant booth at the side. The housekeeper offered Jiang Yi a seat before raising his hand as he said, "Please display your elixirs. If they are good-quality elixirs, we will give you a reasonable monetary offer."

source: 江逸身子一缩走了出去，暗道这五年算是卖身给武殿了，拿了武殿的钱不干活？那就等着武殿无穷无尽的追杀，想到大陆上每一个城池都有武殿分部，江逸都有些不寒而栗……
en_us: Jiang Yi contracted his body and left the room. He muttered to himself about how he had just basically sold his body and soul to the Martial Arts Hall for five years. How could he take money from the Martial Arts Hall and not work for them? If he did not, he would have to face the endless chase by the Martial Arts Hall to kill him. Thinking about how every city in the continent had a branch of the Martial Arts Hall, Jiang Yi could not help but shudder with some fear...

source: 江逸身子一转，转到马飞身后反手勒住他的脖子，另外一只手握着青色短剑，元力灌注紧紧贴着马飞的胸口，只要微微用力这短剑将会刺入马飞的胸口，他目光冷冷的朝众人一扫，沉喝道：“全部退后十丈！”
en_us: Jiang Yi turned to move behind Ma Fei and restrained his neck with a hand. In his other hand was the teal-colored short sword, which was infused with essence force and at the moment being pressed tightly against Ma Fei's chest, ready to penetrate with just the slightest force. Jiang Yi's cold gaze swept across everyone and bellowed, "All of you move back ten feet!"

source: 江逸身子一震，整个人都战栗起来，因为他明显感觉伤口恢复的速度开始加快，而且越来越快，最终治疗的速度达到了原先的五六倍左右，药效都可比人阶上品疗伤丹药了。
en_us: Jiang Yi felt his body tremble and he shuddered. Evidently, his healing speed had accelerated, to the point that the healing speed reached approximately five or six times the original speed. The effects were now on par with Man-tier superior-grade healing elixirs.

source: 江逸身子一颤，江小奴没有一点实力，居然妄图蜉蝣撼树？这要是给这护卫踹上一脚，不得活活踹死啊？
en_us: Jiang Yi trembled. To think that Jiang Xiaonu would try overestimate her capabilities despite her clear lack of strength! If the guard tried to kick her off, wouldn't she end up being kicked to death?

source: 江逸身子一颤，猛然睁开眼睛，面色瞬间变得狰狞，那样子就像一只被激怒鬃毛竖起的狮子王，他身子从地上一跃而起，疯狂的朝前院飙射而去……
en_us: Jiang Yi's body trembled as he opened his eyes suddenly. His face instantly turned grim. He looked like an agitated lion with a bristling mane. Jumping up from the ground, he dashed towards the front yard like a maniac…

source: 江逸身子一颤，还没等他说话，不知什么时候来的柳长老却板着脸说道：“一点药草要取那么久？还不拿出来？哼……废物！”
en_us: Jiang Yi shuddered. Without waiting for him to speak, Elder Liu, whom Jiang Yi had no idea when he entered the room, spoke with a stern face, "How long do you want to take to retrieve a few herbs? Hurry up and bring them over here! Hmph... useless good-for-nothing!"

source: 江逸身子不动，冷然望着江松说了一句。结果江松脸色一变，江逸还没开始数数就慌忙扶着墙壁，一蹦一跳的凭借左腿快速朝远处逃去，只是十几息时间就消失不见了……
en_us: Jiang Yi remained motionless and stared coldly at Jiang Song. As a result, Jiang Song's face changed color. Before Jiang Yi had even started counting down, he hastily relied on his left leg and the wall to hop away. He vanished from sight in about thirty seconds...

source: 江逸身子也滚落在地，但他却如一只猎豹般立即从地上弹射而起，朝江如虎冲去。
en_us: Jiang Yi had also tumbled onto the ground, yet he managed to immediately leap off the ground like a cheetah and once again rush towards Jiang Ruhu.

source: 江逸身子快速在地上转圈起来，用最大的力量，最快的速度将江如龙抡得在半空转圈，等他脑袋差不多晕晕乎乎的时候，再移动脚步猛然朝旁边的墙壁砸去……
en_us: Jiang Yi began to quickly turn his body and used all his strength to whirl Jiang Rulong with his top speed. When Jiang Rulong's mind was in a dazed state, Jiang Yi then moved vigorously to smash Jiang Rulong into the wall...

source: 江逸身子飙射而入，目光如刀子般在里面扫去，一看之下他更是差点气疯了。
en_us: Jiang Yi tore into the room, his eyes sweeping across the room like daggers. What greeted him nearly blew his top.

source: 江逸身影突然在原地一顿，双手一松，江如龙的身子如炮弹般朝上空飞射而去。同时江逸的双腿一蹬，身子快速的跟上，双手抓做落地的江如龙猛然往下压，单腿膝盖却重重的朝他腰身顶去……
en_us: Jiang Yi's body suddenly stayed in place, he then loosened both his hands and launched Jiang Rulong's body high up like a cannonball. At the same time, he catapulted himself with both his legs and swiftly caught up to Jiang Rulong. He used both his hands to grab the falling Jiang Rulong and pressed downwards, using a single knee to position at Jiang Rulong's waist...

source: 江逸转身，痛苦的闭上眼睛，大步朝外面走去，没有再回头看小奴一眼，因为……他生怕多看一眼会不舍得离去。
en_us: Jiang Yi turned around and closed his eyes in anguish. He marched out the doors without a backward glance at Xiaonu, for... he was afraid that looking at her any longer would render him incapable of leaving.

source: 江逸轻叹一声，从怀中取出一把青色的短剑，看着上面流转的青光，他眼中流露出深深的担忧之色。马飞应该找了他一个月吧？他找不到自己，会不会想方设法去找江小奴的麻烦？
en_us: Jiang Yi heaved a sigh and took out a teal-colored short sword from his chest pocket. Staring at its gyrating teal radiance, a deeply troubled look showed on his face. Ma Fei must have been searching for him for a month. With Jiang Yi missing, would he attempt to give Jiang Xiaonu a hard time instead?

source: 江逸轻松过了两人，却似乎忘记还有一人？那铸鼎境三重的武者被江逸晃了一枪，此刻醒悟过来顿时恼羞成怒，大步朝江逸冲来，扬起拳头狠狠对着他的背后砸去。
en_us: Jiang Yi had easily defeated two person, but did it seem as though he forgot one more person? Jiang Yi had flashed past that martial artist with a power level at the third stage of the Cast Tripod Realm. At that moment, he finally came to himself and immediately flew into a rage out of humiliation. He rushed towards Jiang Yi with wide steps and raised up his fists before ferociously smashing downwards onto Jiang Yi's back.

source: 江逸运转一缕黑色元力，在调集一些蓝色元力融合起来，缓缓的控制朝脑袋游走而去。这黑色元力太少太少，不融合蓝色元力怕是不足以完成任何功用。
en_us: Jiang Yi circulated a strand of black essence force and combined it together with some assembled blue essence force, before slowly controlling its movement towards his head. This black essence force was lacking in quantity. If it was not combined with the blue one, he feared that on its own the black essence force was not enough to produce any effect.

source: 江逸这一顶，尽管没有黑色元力融合，但也是实实在在的一马之力，当下那铸鼎境三重武者立即惨叫一声，身子本能弓了下来，本去抓江逸左手的手掌也收了回去，捧住下身痛嚎起来。
en_us: Even though Jiang Yi's single hit was not combined with the power of the black essence force, the attack was nonetheless had an actual horsepower worth of strength. At the moment of impact, that martial artist at the third stage of the Cast Tripod Realm immediately cried out in extreme agony as his body instinctively bent downwards. He had even withdrawn the hand that was supposed to grasp Jiang Yi's left hand, instead using it to cup his crotch as he howled aloud over his searing pain.

source: 江逸这才微微颔首，肉痛的咬牙松开手，眼睁睁的看着才到手几天的紫金进了别人的荷包。
en_us: It was with this offer that Jiang Yi finally nodded silently. His heart ached as he gritted his teeth and released his grip, looking on helplessly as he saw the purple gold he got his hands on just a few days ago enter another person's wallet.

source: 江逸这次没有痛打落水狗了，他早早松开江松双手，漠然看着他惨叫不休，内心没有一丝同情之心。今日如果没有他没有黑色元力，此刻倒在地上惨叫的就是他了，这个世界就是那么残酷，没有实力只有被人欺辱！
en_us: This time, Jiang Yi did not continue beating up his fallen opponent. Instead, he released Jiang Song's hands. Coldly observing him scream relentlessly, Jiang Yi's heart did not feel any sense of sympathy. If he did not have any black essence force that day, the one lying on the ground crying in agony at the moment would have been him. The world was cruel. Those without any power would only end up being bullied and humiliated!

source: 江逸进来之后如此张狂的话语明显触怒了两人，不过江逸点名找江如虎的麻烦，两人城府极深，也不好喧宾夺主都冷冷一哼没有说话，目光投向江如虎，等着看好戏。
en_us: The presumptuous words that Jiang Yi said obviously enraged the two of them. But the one that Jiang Yi called out for, was Jiang Ruhu. They didn't want to claim what wasn't directed at them. They let out cold snorts and casted their sights at Jiang Ruhu, waiting for a good show.

source: 江逸连忙称是，快速离开管事房朝自家小院走去，内心却是暗暗苦恼，要是过两天这荣管事又来问要令牌，或者干脆上他家去要，不得立即暴露啊……
en_us: Jiang Yi promptly replied in the affirmative, before hastily leaving the housekeeping chamber and walking towards the direction of the small courtyard of his own home. He was inwardly distressed in his mind, however. Should Chief Rong return to demand the return of the command token over the next two days, or should he directly head to his house to request for it, his secret would immediately be revealed...

source: 江逸连忙起身，胡乱整理了一下破烂的衣袍，朝外面走去。
en_us: Jiang Yi hastily rose from the bed, hurriedly straightened out and tidied up his tattered clothes, and rushed out of the house.

source: 江逸迷茫了，他听说过丹药能回炉再造，但具体不知道怎么操作的，只看了一早上炼丹就能回炉再造的话，他就是炼丹天才了……
en_us: Jiang Yi was confused. He had heard before that elixirs could be reheated and refined, but he did not know how to perform the specific processes. If all he needed was to observe the refining process for a morning before being able to reheat and refine elixirs, he would probably be a genius in alchemy...

source: 江逸迷迷糊糊的睁开眼睛，感觉全身上下，特别是头部传来阵阵撕裂般的痛楚。他勉强撑起上半身，呲牙咧嘴地朝四处一望，这才发现自己依旧躺在江家西山的药田田埂上。
en_us: When Jiang Yi opened his eyes, he was greeted with a blurry world. Not an inch of his body was spared from the searing pain. Worst of all was his head, which throbbed with unbearable intensity. Red-faced and grimacing, Jiang Yi managed to raise his body up with what little strength he had. As he made sense of his immediate surroundings, Jiang Yi quickly realized that he was lying on an embankment in the Western Hills plantation, one of the many holdings owned by the Jiang Clan.

source: 江逸郁闷得要吐血了，睁开眼睛一扫，发现外面已经天亮了，附近的房间传来窸窸窣窣小奴起床的声音。
en_us: Jiang Yi was so melancholic that he wanted to vomit blood. When he opened his eyes and used his vision to sweep the room, he realized that the sky outside was already bright and rustling sounds of Xiaonu waking up were coming from the nearby room.

source: 江逸都不用黑色元力加持力量，只是凭借恐怖的视力和大成的武技就能轻松的战胜在场的所有人，铸鼎境五重？在他看来屁都不是。
en_us: Jiang Yi didn't even made use of the black essence forces to enhance his strength. He relied on his terrifying vision and Phenomenal Stage martial arts to easily defeat everyone here. Fifth stage of the Cast Tripod Realm? In his eyes, they couldn't defeat a pile of manure.

source: 江逸长长一叹，不再多想，全神贯注开始运转无名决提炼黑色元力。
en_us: Jiang Yi gave a long deep sigh. Not wanting to think about this any further, he placed all his attention on practicing the nameless cultivation technique to refine more black essence force.

source: 江逸闭上眼睛长长吐出一口气，他匕首再次对准马飞的胸口，全力勒住他的脖子让他的尖叫声戛然而止，他目光冰冷的望着刘管事，爆喝起来：“我和风月楼的恩怨今日就此了结，日后你们马家要报复我，尽管放手过来！管事……把我的紫金还给我，否则你家少爷就不是个废人，而是个死人了。”
en_us: Jiang Yi closed his eyes and gave a long exhale. He aimed the short sword at Ma Fei's chest again and cut him off in mid-scream with a full-force choke of his neck. He looked at Housekeeper Liu frostily and roared, "The scores between Fengyue Brothel and me are settled. If the Ma Family wish to seek revenge on me from now on, feel free to bring it on! Housekeeper... return my purple gold, or your young master would not just be useless, but dead."

source: 江逸闭上眼睛，小心翼翼地将注意力集中到自己脑海，便再一次看到了那几十个匪夷可思的神秘篆文，每一个字都无比清晰，黑色骨感，十足活泼，绝对不是幻觉。
en_us: Jiang Yi closed his eyes, carefully focusing his attention on his inner thoughts. Once again, he saw that unimaginably freakish and mysterious script. He could see each character unbelievably clear; they were black, skinny, and moved about energetically. This was definitely no figment of his imagination.

source: 江逸闭上眼睛，探查到眼睛附近的黑色元力果然还有一丝，没有完全消耗干净。再次过了一会，江逸眼中黑光才一闪，视力逐渐模糊起来，黑色元力完全消耗干净了。
en_us: Jiang Yi shut his eyes and checked that there was indeed a wisp of black essence force near his eyes, which had not been completely consumed yet. Once again, after a while, a black flash shone through Jiang Yi's eye, as his visison gradually became more blurry. It looked like the black essence force had completely been consumed.

source: 江逸闭上眼睛，细细感受着身体的变化。
en_us: Jiang Yi closed his eyes, faintly feeling the changes in his body.

source: 江逸闭目等死，这柳长老虽然是负责炼丹的，但战力在江家也是排前十的，这一掌下来他不得活活被拍死？
en_us: Jiang Yi closed his eyes and awaited the incoming slap. Even though Elder Liu was in charge of refining elixirs, he was considered one of the top ten most powerful in the Jiang Clan. Was he not going to be beaten to death with this single slap?

source: 江逸随便交代两句，让她在家呆着别出去，如果有人找上门就躲去后院。他匆匆的朝东院走去，想立即领回丹药，恢复伤势。
en_us: Jiang Yi casually briefed her with two instructions, asking her to stay at home and not go out; additionally, should someone come to the door, she had to hide in the backyard. He hastily walked in the direction of the Eastern Court to immediately retrieve an elixir and heal his injuries.

source: 江逸随便解释了一句，这十多天来他没日没夜的修炼，封印内的符文也再次消融了近百多枚，修炼速度也继续增加，加上杨管事无限的提供灵神丹，他的修炼速度能不快吗？按他估计应该最多三五天，就能突破铸鼎境三重了。
en_us: Jiang Yi provided some random explanation. In the past ten days, he had been cultivating round the clock and reduced close to a hundred characters of the runic patterns of his seal, which caused his cultivation speed to increase further. Coupled with the incessant supply of Spirit Pills from Manager Yang, how could his cultivation speed not be fast? By his calculations, he would be able to make a breakthrough in achieving the third stage of the Cast Tripod Realm.

source: 江逸青铜面具下的脸有些阴沉，嘴唇也有些干，望着马黑旗和柳河阴冷的目光，他有些不寒而栗。
en_us: Jiang Yi's expression, hidden beneath the bronze mask, was gloomy. His lips turned a little dry. The cold and ruthless looks on Ma Heiqi and Liu He made him shudder with unease.

source: 江逸面无表情的一步步朝众人走去，眼中都是冷意，此刻他下半身的黑色长袍被溅满了鲜血，一只手也被染红了，加上他身上凌冽的杀机，别有一番慑人之势。
en_us: Jiang Yi walked towards the group with an indifferent expression. With eyes of chill, Jiang Yi's black robes were covered fresh blood, so was one of his hand. In addition to his sharp killing intent, his entire figure was releasing a frightful presence.

source: 江逸面色一冷，只能脚步一滑，身形很飘逸的退入房间之内，将小奴朝地上一放，再次动用一缕黑色元力运转到拳头，对着一名冲进来的铸鼎境二重武者砸去。
en_us: Jiang Yi's expression turned cold. He could only slide back into the room. Placing Xiaonu on the ground, he once again transferred a wisp of black essence force to his fist and smashed it at the second-stage Cast Tripod Realm warrior who charged in.

source: 江逸面色一凛，暗到这风月楼果然背后有大势力支持，否则一个小小的管事怎么会认识江家的武技？
en_us: Jiang Yi gave the housekeeper a cold stern look. He thought to himself that this Fengyue Brothel did indeed have someone powerful backing them—otherwise, how would a mere housekeeper be able to recognize the martial art techniques of the Jiang Clan?

source: 江逸面色一沉，眼睛一瞪，又训斥道：“小奴，以后不许再说这样的浑话！这个世界少爷只有你这么一个亲人了，任何事情都没有你重要，知道吗？”
en_us: Jiang Yi's face darkened and stared intently at her before chiding, "Xiaonu, don't ever say this kind of silly thing again! You only have me, your young master, as your only loved one in this world, okay? Nothing is more important than you!

source: 江逸顿了一下，迟疑问道：“我能随时离开吗？”
en_us: Jiang Yi paused for a moment. Hesitating briefly, he asked, "Can I leave at any time I want?"

source: 江逸飞射而来，拉着江小奴的手满脸都是惭愧，随即想起什么，咧嘴一笑：“小奴，走回家，我给你看好东西，还有一件天大的好事告诉你。”
en_us: Jiang Yi flew over and pulled Jiang Xiaonu's hand, his face filled with guilt and regret. Immediately being reminded of something, he grinned widely as he said, "Xiaonu, let's go home. I have something good to show you, and I have a piece of extremely good news to tell you."

source: 江顾水两人还是没动，江豹这等小角色伤了就伤了，算不得什么。反而这样能增加江逸的罪行，他们出手就更名正言顺了，不过两人的面色却是越来越难看了。
en_us: Jiang Gushui and Jiang Rulang maintained their position. It didn't matter if such a minor character like Jiang Bao got injured. It would instead increase the offences that Jiang Yi committed and would justify their interference. But the looks on both their faces were getting increasingly unhappy.

source: 江顾水冷喝几声，大手一挥率先朝江逸冲去。家族三少爷都动手了，其余人自然不敢继续坐视不理，江逸虽然看起来有些恐怖，但他一人能是在场数十人的对手？
en_us: After a few shouts, Jiang Gushui gestured with a wave of his hand and was the first to rush at Jiang Yi. Now that the family's Third Young Master was leading the take down, everyone didn't dare to sit on the fence any longer. Jiang Yi may look terrifying but what could one man do against the dozens of people here?

source: 江顾水和江如狼也懵了，他们打过很多架却没见过这么流氓的，两人也看得心惊肉跳，万一江逸一个不小心，江如虎的脑袋砸在地面的青石板上，不得脑浆都得砸出来吗？
en_us: Jiang Gushui and Jiang Rulang were both in a state of lost too. They had many fights but nothing as ruffian as this one. Their hearts were thumping as they looked on. What if Jiang Yi accidentally smashed Jiang Ruhu's head onto the limestone flooring? Wouldn't his brain juices be spilled all over?

source: 江顾水和江如狼微微一惊，对于江逸两人有些面生，但小时候江逸悟性惊人，连江恨水都比下去了，作为同辈人终归是有些印象的。两人明明记得江逸丹田被封印了，好像去年还是铸鼎境一重？怎么一下实力暴涨得那么快了？
en_us: Jiang Gushui and Jiang Rulang got a slight surprise. They were rather unfamiliar with Jiang Yi, but knew that Jiang Yi had exceptional instincts that was even superior than Jiang Henshui's. Being in the same generation, they would more or less have some impression. They could clearly remember Jiang Yi's dantian being sealed and he was only of first stage of the Cast Tripod Realm last year? How did his strength suddenly skyrocketed?

source: 江顾水和江如狼爆喝起来，江如虎身子却是快速的朝两人身后冲去，江如鹰已经去请他哥哥江如龙了。只要江如龙一来，江逸唯有死路一条。江逸今日恶行累累，就算错手杀了他也不是大罪，顶多责罚一番……
en_us: Jiang Gushui and Jiang Rulang bursted out shouting, while Jiang Ruhu swiftly hid behind the two of them. Jiang Ruying had already went seeking for his brother Jiang Rulong. Once Jiang Rulong arrived, Jiang Yi would be left with the path to death. Jiang Yi had sinned gravely today, even if they were to accidentally kill him, it wouldn't be considered a wrongdoing and would at worst receive a scolding...

source: 江顾水幽幽一笑，同样化作六道拳影，对着江逸的六道拳影碰撞而去。在他看来两人相差一个境界，足足一马之力，江逸要是敢和他硬碰硬那是找死。而他攻击速度和反应速度比江逸快多了，就算随便怎么玩，江逸都不是对手！
en_us: Jiang Gushui let out a faint smile and produced six fist shadows to clash with Jiang Yi's six fish shadows. From his view, the two of them had a one stage difference and the strength difference of a one full horsepower. If Jiang Yi dared to go head on against himself, it was like courting death. At the same time, his own attack speed and reaction speed was much superior than Jiang Yi; thus no matter how he approached this, Jiang Yi still wasn't his match!

source: 江顾水等人看的面面相觑，不过倒是早早的安排人去叫人了，他们万万没想到这个被封印的废物，这个他们一直敲都不屑瞧一眼的废物竟变得如此生猛了，不仅一人力压数十人，还轻松战胜了家族年轻一辈排名第二的江如龙。
en_us: Jiang Gushui and the others looked at each other helplessly, but had long went to seek for help. They never would have though the sealed trash, who they looked with disdain, would become such a ferocious existence that could not only oppress dozens of clansmen but easily defeat the Jiang Rulong who was the no.2 of the clan's younger generation.

source: 沉吟了一阵，他只能硬着头皮说道：“赔钱没问题，但能否宽限一些时日？一个月内十两紫金双手奉上，如果拿不出，我就送一只手过来。”
en_us: Silently sighing for some time, all he could do was to summon what courage he had and force himself to say, "Repaying you is not a problem, but can you please extend the deadline by some time? I will hand over to you the ten taels of purple gold within a month's time. If I can't return it, I’ll send a hand of mine over."

source: 沙哑的声音中，带着几分居高临下，听上去就好象是在审问犯人。
en_us: His hoarse voice, coupled with a hint of scorn, made it seem as if he was interrogating a criminal.

source: 沙沙沙！
en_us: Shh-shh-shh!

source: 没人会选择一个心怀怨恨的盟友，哪怕心怀怨恨的只是盟友的儿子也不行。
en_us: No one would choose an ally who harbored resentment, even if it was only the ally's son who harbored the said resentment.

source: 没奈何……
en_us: Unfortunately, for the young Jiang Yi…

source: 没想到一过来，却听到这样一个让他绝望的消息，这柳长老既然让江逸留下了，他就再也没机会了……
en_us: He never thought that, once he got there, he would hear such despairing information. Since Elder Liu let Jiang Yi stay, he would never have any other opportunity again...

source: 没有任何多余的手势，没有丝毫吟唱的声音。
en_us: There was no redundant gesture nor sound of chanting at all.

source: 没有任何意外，这铸鼎境二重的护卫痛哼一声，身子倒飞出去，连带着把背后一名护卫一起撞飞出去。
en_us: Everything happened as expected. The second-stage Cast Tripod Realm guard screamed in pain before tumbling back out of the room, along with another guard that was behind him.

source: 没有元力加持，全力使用武技非常消耗体力，翊凌雪一轮暴雨拳砸出，整个人立即累得气喘吁吁，要不是江逸在，她都会一屁股坐在地上了。
en_us: Without any essence force as support, a lot of energy was consumed when one put in all his or her might to do combat in martial arts. After Yi Lingxue used a round of her Thunderstorm Fist techniques and smashed forward in her attacks, her entire person became immediately tired, leaving her panting profusely. If Jiang Yi was not there, she would immediately sit her buttocks down on the ground.

source: 没有元力的加持，她刚才打了两场，此刻又连续攻击了那么久，已经算是难能可贵了，每一拳每一招她可是全力使出的，体力消耗太大了。
en_us: Without the additional support of essence force, and having just fought two rounds of combat, it was considered remarkable that she could still continuously attack for such a long time. She exerted her full force in every single punch and technique, after all. This consumed way too much of her bodily energy at once.

source: 没有元力的加持，就算那群公子小姐反应速度再快，又能快到哪去？比武技，谁怕谁？
en_us: Without essence force, even if the reaction speeds of that group of young masters and young mistresses were fast, how fast could their speed possibly be? In comparing martial arts abilities, what was there to be afraid of?

source: 没有原因，没有理由，就是这么简单而又粗暴的一记冲击水幕，彻底粉碎了克伦威尔二十几年的骄傲。
en_us: There were no explanations and no reasons. It was merely a simple yet brutal Waterfall Strike, and it had thoroughly shattered the pride Cromwell held for over 20 years.

source: 没有多余的手势，也没有复杂的咒文。
en_us: There were no other gestures, and no complex spells.

source: 没有意外，两人身子一个踉跄扑到在地，而江逸的身子再次爆射而去，朝前方的江如虎冲去，眼中都是冷意大喝起来：“江如虎，可敢一战？”
en_us: As expected, the bodies of both his opponents staggered and crashed to the ground one by one. As for Jiang Yi, his body once again shot explosively forward, rushing towards Jiang Ruhu who was in front of him. With his eyes filled with a sense of coldness, he started shouting aloud, "Jiang Ruhu, do you dare to fight?"

source: 没等江逸看够玩够时，黑色元力再次消耗完毕，世界又恢复了原样。
en_us: The black essence force again dissipated before Jiang Yi could have his fun, restoring the world to its original state.

source: 没过一会，房间再次打开了，那位带着红色熊首面具武者被一脚踹飞出来，紧接着翊小姐的声音又冷漠传来：“换人！”
en_us: It was not a while before the door was opened once again, as the martial artist wearing the red bear mask was kicked and sent flying out. This was followed by Young Mistress Yi's cold voice. "Change my partner!"

source: 洗衣服的老妈子们，全部惊恐的四处乱跑，看向江逸的眼神已经和死人无异，小奴也害怕的身子瑟瑟发抖。
en_us: The old chambermaids who were washing laundry scrambled away in fear, looking at Jiang Yi as though he were no different from a dead man. Xiaonu was also trembling with fear.

source: 消息公布的当天，一群上了年纪的魔法师当场激动得老泪纵横，他们都不记得自己有多少年没闻过清醒药剂的味道了，捧着一瓶清醒药剂回去的时候，他们觉得自己简直就象生活在天堂一样。
en_us: On the day the news was announced, a group of elderly mages were thrilled to tears on the spot. They could not remember how many years it had been since they had had a whiff of the Sobriety Potion. When they returned with a bottle of Sobriety Potion in their hands, they felt as if they were living in heaven.

source: 淡淡的清香在药剂室里弥漫，烧杯中的药剂正发出“咕隆咕隆”的声响。
en_us: A delicate fragrance filled the potion lab while the potion in the beaker gurgled.

source: 清晨上线之后，林立依旧是循例先登入法师小号。
en_us: As per usual in the mornings, Lin Li logged on his smurf[1. In online gaming, a smurf is an experienced player who uses a new account to deceive other players into thinking he's a noob (newbie).] account—which was a mage—the first thing after he went online.

source: 清点了一遍丹房内的丹药，确定江恨水只取了一百枚灵神丹，江逸无所事事继续开始修炼。
en_us: After accounting for the elixirs in the elixir room, and confirming that Jiang Henshui had only retrieved a hundred Spirit Pills, Jiang Yi had nothing to do and as such continued cultivation practice.
